In [135]:
import numpy as np
import pandas as pd

# Data Cleaning
- first find missing data (fill, drop record, use avg...call someone)
- second, identify invalid values (numbers where strings, out of range, ridiculous age,...)
- third, 
- fourth,

throw the pandas methods around like they are functions, or just use them on the instance
they will be immutable until you do something with them

In [136]:
pd.isnull(np.nan) # numpy identifies not-a-number "nan"

True

In [137]:
pd.isnull(None) # None is more for python

True

In [138]:
pd.isna(np.nan) # same as null

True

In [139]:
pd.isna(None) # same

True

In [140]:
pd.notnull(np.nan) # conjugate

False

In [141]:
pd.notnull(None) # conjugate

False

In [142]:
pd.notnull(3)

True

In [143]:
pd.isnull(pd.Series([1, np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [144]:
pd.notnull(pd.Series([1, np.nan, 7]))

0     True
1    False
2     True
dtype: bool

In [145]:
pd.isnull(pd.DataFrame({
    'Col_A': [1, 2, np.nan],
    'Col_B': [3, np.nan, 4],
    'Col_C': [np.nan, 5, 6]
}))

   Col_A  Col_B  Col_C
0  False  False   True
1  False   True  False
2   True  False  False

In [146]:
pd.notnull(pd.DataFrame({
    'Col_A': [1, 2, np.nan],
    'Col_B': [3, np.nan, 4],
    'Col_C': [np.nan, 5, 6]
}))

   Col_A  Col_B  Col_C
0   True   True  False
1   True  False   True
2  False   True   True

In [147]:
s = pd.Series([1, 2, 3, np.nan, np.nan, 4])
nullz = pd.isnull(s).sum()
nnullz = pd.notnull(s).sum()
print(f"null:  {nullz}  ,  not-null:  {nnullz}")

null:  2  ,  not-null:  4

In [148]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [149]:
s.notnull()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [150]:
s[s.notnull()]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [151]:
ss = s.dropna() # get rid of empty
print(ss)

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [152]:
df = pd.DataFrame({
    'Col_A': [1, 2, 3, np.nan],
    'Col_B': [4, 5, np.nan, np.nan],
    'Col_C': [6, np.nan, np.nan, np.nan],
    'Col_D': [7, 8, 9, 10]
})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col_A   3 non-null      float64
 1   Col_B   2 non-null      float64
 2   Col_C   1 non-null      float64
 3   Col_D   4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [153]:
df.head()

   Col_A  Col_B  Col_C  Col_D
0    1.0    4.0    6.0      7
1    2.0    5.0    NaN      8
2    3.0    NaN    NaN      9
3    NaN    NaN    NaN     10

In [154]:
df.shape

(4, 4)

In [155]:
df.isnull()

   Col_A  Col_B  Col_C  Col_D
0  False  False  False  False
1  False  False   True  False
2  False   True   True  False
3   True   True   True  False

In [156]:
df.isnull().sum()

Col_A    1
Col_B    2
Col_C    3
Col_D    0
dtype: int64

In [157]:
temp = df.dropna() # drop any row with at least 1 null value
print(temp)

   Col_A  Col_B  Col_C  Col_D
0    1.0    4.0    6.0      7

In [158]:
df.dropna(axis=1) # drop columns with at least 1 null value

   Col_D
0      7
1      8
2      9
3     10

In [159]:
df2 = pd.DataFrame({
    'A':[1, np.nan, 3],
    'B':[2, np.nan, 33],
    'C':[np.nan, np.nan, 333]
})
print(df2)

     A     B      C
0  1.0   2.0    NaN
1  NaN   NaN    NaN
2  3.0  33.0  333.0

In [160]:
df2.dropna(how='all') # drop the row where all entries are null

     A     B      C
0  1.0   2.0    NaN
2  3.0  33.0  333.0

In [161]:
df2.dropna(how='any') # default behavior, any null in a row is dropped

     A     B      C
2  3.0  33.0  333.0

In [162]:
df2.dropna(thresh=2, axis='columns') # another way (drop column with > 2 null values)

     A     B
0  1.0   2.0
1  NaN   NaN
2  3.0  33.0

In [163]:
s.fillna(0) # fill null with 0

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [164]:
s.fillna(s.mean()) # or fill with anything

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [165]:
s.fillna(method='ffill') # forward fill the null !!! can't have starting null

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [166]:
s.fillna(method='bfill') # backward fill the null !!! can't have ending null

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

In [167]:
df.fillna(method='ffill', axis=0) # by row, horizontal

   Col_A  Col_B  Col_C  Col_D
0    1.0    4.0    6.0      7
1    2.0    5.0    6.0      8
2    3.0    5.0    6.0      9
3    3.0    5.0    6.0     10

In [168]:
df.fillna(method='ffill', axis=1) # by column, vertical

   Col_A  Col_B  Col_C  Col_D
0    1.0    4.0    6.0    7.0
1    2.0    5.0    5.0    8.0
2    3.0    3.0    3.0    9.0
3    NaN    NaN    NaN   10.0

In [169]:
df = pd.DataFrame({
    'Sex': ['M', 'F', 'F', 'D', '?'],
    'Age': [29, 30, 24, 290, 25]
})
print(df)

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [170]:
df['Sex'].unique() # should only have M F

array(['M', 'F', 'D', '?'], dtype=object)

In [171]:
df['Sex'].value_counts() # similar check for unique values

F    2
M    1
D    1
?    1
Name: Sex, dtype: int64

In [172]:
df['Sex'].replace('D', 'F') # changes D -> F

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [173]:
df['Sex'].replace({'D':'F', '?':'M'}) # multiple replace with dictionary

0    M
1    F
2    F
3    F
4    M
Name: Sex, dtype: object

In [174]:
df.replace({
    'Sex': {'D':'F', '?':'M'},
    'Age': {290:29}
}) # works on entire dataframe

  Sex  Age
0   M   29
1   F   30
2   F   24
3   F   29
4   M   25

In [175]:
df[df['Age'] > 100] # know domain, age > 100 for a human is unlikely

  Sex  Age
3   D  290

In [176]:
df.loc[df['Age'] > 100, 'Age'] = df.loc[df['Age'] > 100, 'Age'] / 10 # fix by removing a zero
print(df)

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D   29
4   ?   25

# Duplicates
every type (string, category, etc) has associated methods

In [177]:
ambassadors = pd.Series([
    'France',
    'UK',
    'UK',
    'Italy',
    'Germany',
    'Germany',
    'Germany'
], index = [
        'Gerard Araud',
        'Kim Darroch',
        'Peter Westmacott',
        'Armando Whopper',
        'Peter Witing',
        'Ammon Hans',
        'Klaus Himmler'
])
print(ambassadors)

Gerard Araud         France
Kim Darroch              UK
Peter Westmacott         UK
Armando Whopper       Italy
Peter Witing        Germany
Ammon Hans          Germany
Klaus Himmler       Germany
dtype: object

In [178]:
ambassadors.duplicated() # by default, looks top down

Gerard Araud        False
Kim Darroch         False
Peter Westmacott     True
Armando Whopper     False
Peter Witing        False
Ammon Hans           True
Klaus Himmler        True
dtype: bool

In [179]:
ambassadors.duplicated(keep='last') # looks bottom to top

Gerard Araud        False
Kim Darroch          True
Peter Westmacott    False
Armando Whopper     False
Peter Witing         True
Ammon Hans           True
Klaus Himmler       False
dtype: bool

In [180]:
ambassadors.duplicated(keep=False) # remove any duplicate (any duplicate is marked True)

Gerard Araud        False
Kim Darroch          True
Peter Westmacott     True
Armando Whopper     False
Peter Witing         True
Ammon Hans           True
Klaus Himmler        True
dtype: bool

In [181]:
ambassadors.unique()

array(['France', 'UK', 'Italy', 'Germany'], dtype=object)

In [182]:
ambassadors.drop_duplicates()

Gerard Araud        France
Kim Darroch             UK
Armando Whopper      Italy
Peter Witing       Germany
dtype: object

In [183]:
ambassadors.drop_duplicates(keep='last')

Gerard Araud         France
Peter Westmacott         UK
Armando Whopper       Italy
Klaus Himmler       Germany
dtype: object

In [184]:
ambassadors.drop_duplicates(keep=False)

Gerard Araud       France
Armando Whopper     Italy
dtype: object

In [185]:
players = pd.DataFrame({
    'Name' : [
        'kobe',
        'lebron',
        'kobe',
        'carmelo',
        'kobe'
    ],
    'Pos' : [
        'sg',
        'sf',
        'sg',
        'sf',
        'sf'
    ]
})
players

      Name Pos
0     kobe  sg
1   lebron  sf
2     kobe  sg
3  carmelo  sf
4     kobe  sf

In [186]:
players.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [187]:
players.duplicated(subset=['Name'])

0    False
1    False
2     True
3    False
4     True
dtype: bool